# Rebar Shape Is Same Shape Ignoring Hooks Method

Source: https://www.revitapidocs.com/2026/5815937c-ac80-2f85-ff5a-4e728336251e.htm

---

| Rebar Shape Is Same Shape Ignoring Hooks Method |
| --- |

**Note: This API is now obsolete.**

Test whether two shapes have equivalent definitions by comparing
 the RebarShapeDefinition and MultiplanarDefinition properties.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarShape.IsSameShapeIgnoringTerminations instead.")]
public bool IsSameShapeIgnoringHooks(
	RebarShape otherShape
)
```

```
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarShape.IsSameShapeIgnoringTerminations instead.")>
Public Function IsSameShapeIgnoringHooks (
	otherShape As RebarShape
) As Boolean
```

```
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarShape.IsSameShapeIgnoringTerminations instead.")]
bool IsSameShapeIgnoringHooks(
	RebarShape^ otherShape
)
```

```
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarShape.IsSameShapeIgnoringTerminations instead.")>]
member IsSameShapeIgnoringHooks :
        otherShape : RebarShape -> bool
```

#### Parameters

otherShape RebarShape
:   Another shape to be compared to this one.

#### Return Value

Boolean
True if the shape definitions match, false otherwise. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

Remarks This method will return true if the definitions are exactly equivalent.
 The hooks, cranks, end treatments, orientations and terminations' rotation angles are ignored. See Also

#### Reference

RebarShape Class Autodesk.Revit.DB.Structure Namespace